micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
     * Wait for 10s timeout
     */
    if (CY_RSLT_SUCCESS == result) {
        cyhal_system_delay_ms(10000);
    }

    /* Define PRINT_HEAP_USAGE using DEFINES variable in the Makefile. */
    // print_heap_usage("After scan results are printed to UART");
    return res;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_scan_obj, 1, network_ifx_wcm_scan);

/* WHD based implementation - Future use
STATIC mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_passive, ARG_ssid, ARG_essid, ARG_bssid, ARG_channels };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_passive, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_essid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channels, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Deprecated kwarg
    if (args[ARG_essid].u_obj != mp_const_none) {
        args[ARG_ssid].u_obj = args[ARG_essid].u_obj;
    }

    // Extract scan type, if given.
    // Note: WC driver provides also prohibited channel,
    // currently not added to keep the interface as similar
    // to the cy43w network module implementation.
    whd_scan_type_t scan_type = WHD_SCAN_TYPE_PASSIVE;
    if (args[ARG_passive].u_bool) {
        scan_type = WHD_SCAN_TYPE_ACTIVE;
    }

    // Extract ssid, if given
    cy_wcm_ssid_t *ssid_ptr = NULL;
    cy_wcm_ssid_t ssid;


    if (args[ARG_ssid].u_obj != mp_const_none) {
        ssid_ptr = &ssid;
        mp_buffer_info_t ssid_arg;
        mp_get_buffer_raise(args[ARG_ssid].u_obj, &ssid_arg, MP_BUFFER_READ);
        ssid.length = MIN(ssid_arg.len, SSID_NAME_SIZE);
        memcpy(ssid.value, ssid_arg.buf, ssid.length);
    }

    // Extract bssid, if given
    cy_wcm_mac_t *bssid_ptr = NULL;
    cy_wcm_mac_t bssid;
    if (args[ARG_bssid].u_obj != mp_const_none) {
        bssid_ptr = &bssid;
        mp_buffer_info_t bssid_arg;
        mp_get_buffer_raise(args[ARG_bssid].u_obj, &bssid_arg, MP_BUFFER_READ);
        memcpy(bssid.octet, bssid_arg.buf, 6);
    }

    // Extract channel list, if provided
    uint16_t channel_list[sizeof(uint8_t)] = {0};
    if (args[ARG_channels].u_obj != mp_const_none) {
        mp_buffer_info_t channels_arg;
        mp_get_buffer_raise(args[ARG_channels].u_obj, &channels_arg, MP_BUFFER_READ);
        memcpy(channel_list, channels_arg.buf, channels_arg.len);
        channel_list[channels_arg.len] = 0; // The channel list array needs to be zero terminated.
    }

    // Note: Optional extended parameters are not provided.
    whd_scan_status = WHD_SCAN_INCOMPLETE;
    mp_obj_t res = mp_obj_new_list(0, NULL);
    uint32_t ret = whd_wifi_scan(whd_ifs[self->itf], scan_type, WHD_BSS_TYPE_ANY, ssid_ptr, bssid_ptr, channel_list, NULL, network_ifx_whd_scan_cb, &whd_scan_result, &res);
    wcm_assert_raise(ret);

    // Wait for scan to finish, with a 10s timeout
    uint32_t start = mp_hal_ticks_ms();
    while (whd_scan_status && (mp_hal_ticks_ms() - start < 10000)) {
        MICROPY_EVENT_POLL_HOOK
    }

    return res;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_whd_scan_obj, 1, network_ifx_whd_scan);
*/

STATIC mp_obj_t network_ifx_wcm_connect(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_ssid, ARG_key, ARG_auth, ARG_security, ARG_bssid, ARG_channel };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_ssid, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_key, MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_auth, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_security, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channel, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };


    /* Maximum Wi-Fi re-connection limit. */
    #define MAX_WIFI_CONN_RETRIES             (120u)

    /* Wi-Fi re-connection time interval in milliseconds. */
    #define WIFI_CONN_RETRY_INTERVAL_MS       (5000)

    #define WIFI_CONNECTED                   (1lu << 1)

    /* Flag to denote initialization status of various operations. */
    // uint32_t status_flag;

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_wcm_connect_params_t connect_param;
    cy_wcm_ip_address_t ipaddress;
    memset(&connect_param, 0, sizeof(cy_wcm_connect_params_t));

    // Deprecated kwarg
    if (args[ARG_auth].u_int != -1) {
        args[ARG_security] = args[ARG_auth];
    }

    // Extract the SSID.
    mp_buffer_info_t ssid;
    mp_get_buffer_raise(args[ARG_ssid].u_obj, &ssid, MP_BUFFER_READ);
    // TODO: Check length cannot be more than 32 bytes. Limited by whd lib. Validate argument!
    memcpy(connect_param.ap_credentials.SSID, ssid.buf, ssid.len);

    // Extract the key, if given.
    mp_buffer_info_t key;
    key.buf = NULL;
    if (args[ARG_key].u_obj != mp_const_none) {
        mp_get_buffer_raise(args[ARG_key].u_obj, &key, MP_BUFFER_READ);
    }
    memcpy(connect_param.ap_credentials.password, key.buf, key.len);

    // // Extract the BSSID, if given.
    // mp_buffer_info_t bssid;
    // bssid.buf = NULL;
    // if (args[ARG_bssid].u_obj != mp_const_none) {
    //     mp_get_buffer_raise(args[ARG_bssid].u_obj, &bssid, MP_BUFFER_READ);
    //     cy_wcm_mac_t wcm_bssid;

    //     // Check if the given bssid matches the interface bssid
    //     uint32_t ret = whd_wifi_get_bssid(itf, &wcm_bssid);
    //     wcm_assert_raise(ret);

    //     if (bssid.len != 6) {
    //         if (strncmp(bssid.buf, (char *)whd_bssid.octet, 6)) {
    //             mp_raise_ValueError(NULL);
    //         }
    //     }
    // }

