micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
                return MP_OBJ_NEW_SMALL_INT(security);
            }

            case MP_QSTR_mac: {
                wl_bss_info_t bss_info;
                uint32_t ret = whd_wifi_get_bss_info(whd_ifs[self->itf], &bss_info);
                wcm_assert_raise(ret);

                return mp_obj_new_bytes(bss_info.BSSID.octet, 6);
            }
            case MP_QSTR_txpower: {
                uint8_t buf[13];
                memcpy(buf, "qtxpower\x00\x00\x00\x00\x00", 13);
                uint32_t ret = whd_wifi_get_ioctl_buffer(whd_ifs[self->itf], WLC_GET_VAR, buf, 13);
                wcm_assert_raise(ret);

                return MP_OBJ_NEW_SMALL_INT(nw_get_le32(buf) / 4);
            }

            case MP_QSTR_hostname: {
                mp_raise_ValueError(MP_ERROR_TEXT("deprecated. use network.hostname() instead."));
                break;
            }

            default:
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
        }
    } else {
        // Set config value(s)
        if (n_args != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("can't specify pos and kw args"));
        }

        for (size_t i = 0; i < kwargs->alloc; ++i) {
            if (MP_MAP_SLOT_IS_FILLED(kwargs, i)) {
                mp_map_elem_t *e = &kwargs->table[i];
                switch (mp_obj_str_get_qstr(e->key)) {
                    case MP_QSTR_antenna: {
                        uint8_t buf[4];
                        nw_put_le32(buf, mp_obj_get_int(e->value));
                        uint32_t ret = whd_wifi_set_ioctl_buffer(whd_ifs[self->itf], WLC_SET_ANTDIV, buf, 4);
                        wcm_assert_raise(ret);
                        break;
                    }
                    case MP_QSTR_channel: {
                        uint32_t ret = whd_wifi_set_channel(whd_ifs[self->itf], mp_obj_get_int(e->value));
                        wcm_assert_raise(ret);
                        break;
                    }
                    case MP_QSTR_ssid:
                    case MP_QSTR_essid: {
                        // TODO: Implement ssid/essid change. Explore WHD to change name
                        // managing the state. Only available in the API via whd_wifi_init_ap.

                        // size_t len;
                        // const char *ssid_str = mp_obj_str_get_data(e->value, &len);
                        // whd_security_t security;
                        // wl_bss_info_t bss_info;
                        // uint32_t ret = whd_wifi_get_ap_info(itf, &bss_info, &security);
                        // if (ret != WHD_SUCCESS) {
                        //     mp_raise_OSError(-ret);
                        // }
                        // whd_ssid_t whd_ssid;
                        // memcpy(whd_ssid.value, ssid_str, len);
                        // whd_ssid.length = len;
                        // uint32_t ret = whd_wifi_init_ap(itf, &whd_ssid, &security,  );

                        break;
                    }
                    case MP_QSTR_monitor: {
                        mp_int_t value = mp_obj_get_int(e->value);
                        uint8_t buf[9 + 4];
                        memcpy(buf, "allmulti\x00", 9);
                        nw_put_le32(buf + 9, value);
                        uint32_t ret = whd_wifi_set_ioctl_buffer(whd_ifs[self->itf], WLC_SET_VAR, buf, 9 + 4);
                        wcm_assert_raise(ret);
                        nw_put_le32(buf, value);
                        ret = whd_wifi_set_ioctl_buffer(whd_ifs[self->itf], WLC_SET_MONITOR, buf, 4);
                        wcm_assert_raise(ret);
                        // In cyw43 they keep the trace flags in a variable.
                        // TODO. Understand how are these trace flags used, and if
                        // an equivalent tracing feature can/should be enabled
                        // for the WHD.
                        // if (value) {
                        //     self->cyw->trace_flags |= CYW43_TRACE_MAC;
                        // } else {
                        //     self->cyw->trace_flags &= ~CYW43_TRACE_MAC;
                        // }
                        break;
                    }
                    case MP_QSTR_security: {
                        // TODO: Implement AP security change
                        break;
                    }
                    case MP_QSTR_key:
                    case MP_QSTR_password: {
                        // TODO: Implement AP password change
                        break;
                    }
                    case MP_QSTR_pm: {
                        // TODO: Implement pm? What is pm in the cyw43? power management
                        break;
                    }
                    case MP_QSTR_trace: {
                        // TODO: Implement tracing.
                        break;
                    }
                    case MP_QSTR_txpower: {
                        mp_int_t dbm = mp_obj_get_int(e->value);
                        uint8_t buf[9 + 4];
                        memcpy(buf, "qtxpower\x00", 9);
                        nw_put_le32(buf + 9, dbm * 4);
                        uint32_t ret = whd_wifi_set_ioctl_buffer(whd_ifs[self->itf], WLC_SET_VAR, buf, 9 + 4);
                        wcm_assert_raise(ret);
                        break;
                    }
                    case MP_QSTR_hostname: {
                        mp_raise_ValueError(MP_ERROR_TEXT("deprecated. use network.hostname() instead."));
                        break;
                    }

                    default:
                        mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
                }
            }
        }

        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_config_obj, 1, network_ifx_wcm_config);

/*******************************************************************************/
// class bindings

STATIC const mp_rom_map_elem_t network_ifx_wcm_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_send_ethernet), MP_ROM_PTR(&network_ifx_wcm_send_ethernet_obj) },

    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&network_ifx_wcm_deinit_obj) }, // shall this be part of the module ??
    { MP_ROM_QSTR(MP_QSTR_active), MP_ROM_PTR(&network_ifx_wcm_active_obj) },
    { MP_ROM_QSTR(MP_QSTR_scan), MP_ROM_PTR(&network_ifx_wcm_scan_obj) },
    { MP_ROM_QSTR(MP_QSTR_connect), MP_ROM_PTR(&network_ifx_wcm_connect_obj) },
    { MP_ROM_QSTR(MP_QSTR_disconnect), MP_ROM_PTR(&network_ifx_wcm_disconnect_obj) },
    { MP_ROM_QSTR(MP_QSTR_isconnected), MP_ROM_PTR(&network_ifx_wcm_isconnected_obj) },
    { MP_ROM_QSTR(MP_QSTR_ifconfig), MP_ROM_PTR(&network_ifx_wcm_ifconfig_obj) },
    { MP_ROM_QSTR(MP_QSTR_status), MP_ROM_PTR(&network_ifx_wcm_status_obj) },
    { MP_ROM_QSTR(MP_QSTR_config), MP_ROM_PTR(&network_ifx_wcm_config_obj) },

